nxp-mcuxpresso/mcuxsdk-examples/_boards/rdrw612bga/driver_examples/spi/eeprom/pin_mux.c
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "pin_mux.h"
#include "fsl_io_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: Cortex-M33[cm33] */
   MCI_IO_MUX->FC14 = MCI_IO_MUX_FC14_SEL_FC14_SPI_MASK;
   SOCCTRL->MCI_IOMUX_EN1 |= 0x03600000U;
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
